name: "qwen3_embedding"
platform: "onnxruntime_onnx"
max_batch_size: 16
input: [
  { name: "input_ids", data_type: TYPE_INT64, dims: [ -1 ] },
  { name: "attention_mask", data_type: TYPE_INT64, dims: [ -1 ] }
]
output: [
  { name: "embedding", data_type: TYPE_FP32, dims: [ -1 ] }
]
# Ensure Triton picks model.onnx (with external data files alongside)
default_model_filename: "model.onnx"

dynamic_batching {
  preferred_batch_size: [ 2, 4, 8 ]
  max_queue_delay_microseconds: 2000
}
instance_group [ { kind: KIND_GPU, count: 1 } ]

